load_tests/general.yml
config:
  target: "http://localhost/api/v1"
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load

scenarios:
  - name: "random shit"
    flow:
      - get:
          url: "/user"
          capture:
            - json: "$.results[0].id"
              as: "userId"
      - get:
          ur: "/users/{{ userId }}"
      - think: 5
      - post:
          url: "/application-settings"
          json:
            productId: "{{ userId }}"